

"Checking" = "检查中...";

"No updates found" = "恭喜！您当前的版本已经是最新";

"Update checking error" = "检查出错，请稍后重试。";

"Feedback" = "用户反馈";

"Check for update" = "检查新版本";

"Version" = "版本";

"New Version Found" = "发现新版本: ";

"Skip" = "跳过";

"Ignore" = "忽略";

"Update now" = "立即更新";

"About" = "关于";

"Return" = "返回";

"Current Location" = "当前位置";

"Target Location" = "穿越位置";

"Exploring On..." = "您正在穿越中...";

"Exploring Off..." = "已退出穿越...";

"Longitude" = "经度";

"Latitude" = "纬度";

"To set target location, please long press the map in the area of the blue circle" = "请用手指长按蓝色圆圈范围内，以选取穿越位置";

"Notice" = "温馨提醒";

"Ok" = "好";

"Done" = "完成";

"For now, you can only explore places within %d kilometer(s). Update and explore around the globe." = "您现在的穿越范围是%dkm（蓝色圆圈以内），请下载新版本以扩大范围";

"Location service unvailable, check your settings please." = "定位失败，请检查您的设备。";